akobyl/STM32_IoTBoard_BTLE_Demo/Src/serial.c
/*
 * FreeRTOS Kernel V10.1.1
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

/*
 BASIC INTERRUPT DRIVEN SERIAL PORT DRIVER FOR UART0.
 */
#include "assert.h"
#include <stdbool.h>

/* Scheduler includes. */
#include "FreeRTOS.h"
#include "queue.h"
#include "semphr.h"

/* Library includes. */
#include "stm32l4xx_hal.h"
#include "stm32l4xx_it.h"
#include "stm32l4_b_l475e_iot01a.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_rcc.h"

/* Demo application includes. */
#include "serial.h"
/*-----------------------------------------------------------*/

/* Misc defines. */
#define serINVALID_QUEUE				( ( QueueHandle_t ) 0 )
#define serNO_BLOCK						( ( TickType_t ) 0 )
#define serTX_BLOCK_TIME				( 40 / portTICK_PERIOD_MS )

/*-----------------------------------------------------------*/

/* The queue used to hold received characters. */
static QueueHandle_t xRxedChars;
static QueueHandle_t xCharsForTx;

/*-----------------------------------------------------------*/

/* UART interrupt handler. */
void vUARTInterruptHandler(void);

/*-----------------------------------------------------------*/

/*
 * See the serial2.h header file.
 */
xComPortHandle xSerialPortInitMinimal(unsigned long ulWantedBaud,
                                      unsigned portBASE_TYPE uxQueueLength)
{
    xComPortHandle xReturn = 0;
    GPIO_InitTypeDef GPIO_InitStruct;

    /* Create the queues used to hold Rx/Tx characters. */
    xRxedChars = xQueueCreate(uxQueueLength,
                              (unsigned portBASE_TYPE) sizeof(signed char));
    xCharsForTx = xQueueCreate(uxQueueLength + 1,
                               (unsigned portBASE_TYPE) sizeof(signed char));

    vQueueAddToRegistry(xCharsForTx, "TxQueue");
    vQueueAddToRegistry(xRxedChars, "RxQueue");

    /**USART1 GPIO Configuration
     PB6     ------> USART1_TX
     PB7     ------> USART1_RX
     */
    __HAL_RCC_USART1_CLK_ENABLE()
    ;

    GPIO_InitStruct.Pin = ST_LINK_UART1_TX_Pin | ST_LINK_UART1_RX_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    // Initialize UART with LL drivers (not HAL)
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);

    LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_PCLK2);

    // Initialize UART interrupts
    NVIC_SetPriority(USART1_IRQn, 7);
    NVIC_EnableIRQ(USART1_IRQn);

    LL_USART_SetTransferDirection(USART1, LL_USART_DIRECTION_TX_RX);

    LL_USART_ConfigCharacter(USART1, LL_USART_DATAWIDTH_8B, LL_USART_PARITY_NONE,
                             LL_USART_STOPBITS_1);

    LL_USART_SetHWFlowCtrl(USART1, LL_USART_HWCONTROL_NONE);

    LL_USART_SetBaudRate(USART1, 80000000, LL_USART_OVERSAMPLING_16, 115200);

    LL_USART_Enable(USART1);

    LL_USART_ClearFlag_ORE(USART1);
    LL_USART_EnableIT_RXNE(USART1);

    /* Wait for TXE flag to be raised */
    while(!LL_USART_IsActiveFlag_TXE(USART1));

    return xReturn;
}
/*-----------------------------------------------------------*/

signed portBASE_TYPE xSerialGetChar(xComPortHandle pxPort,
                                    signed char *pcRxedChar, TickType_t xBlockTime)
{
    /* The port handle is not required as this driver only supports one port. */
    (void) pxPort;

    /* Get the next character from the buffer.  Return false if no characters
     are available, or arrive before xBlockTime expires. */
    if(xQueueReceive(xRxedChars, pcRxedChar, xBlockTime))
    {
        return pdTRUE;
    }
    else
    {
        return pdFALSE;
    }
}
/*-----------------------------------------------------------*/

void vSerialPutString(xComPortHandle pxPort, const signed char * const pcString,
                      unsigned short usStringLength)
{
    signed char *pxNext;

    /* A couple of parameters that this port does not use. */
    (void) usStringLength;
    (void) pxPort;

    /* NOTE: This implementation does not handle the queue being full as no
     block time is used! */

    /* The port handle is not required as this driver only supports UART1. */
    (void) pxPort;

    /* Send each character in the string, one at a time. */
    pxNext = (signed char *) pcString;
    while(*pxNext)
    {
        xSerialPutChar(pxPort, *pxNext, serTX_BLOCK_TIME);
        pxNext++;
    }
}
/*-----------------------------------------------------------*/

signed portBASE_TYPE xSerialPutChar(xComPortHandle pxPort, signed char cOutChar,
                                    TickType_t xBlockTime)
{
    signed portBASE_TYPE xReturn;

    if(xQueueSend(xCharsForTx, &cOutChar, xBlockTime) == pdPASS)
    {
        xReturn = pdPASS;
        LL_USART_EnableIT_TXE(USART1);
    }
    else
    {
        xReturn = pdFAIL;
    }

    return xReturn;
}
/*-----------------------------------------------------------*/

void vSerialClose(xComPortHandle xPort)
{
    /* Not supported as not required by the demo application. */
}
/*-----------------------------------------------------------*/

void USART1_IRQHandler(void)
{
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
    char cChar;

    // Tx buffer is empty, but
    if(LL_USART_IsEnabledIT_TXE(USART1) && LL_USART_IsActiveFlag_TXE(USART1))
    {

        /* The interrupt was caused by the THR becoming empty.  Are there any
         more characters to transmit? */
        if(xQueueReceiveFromISR(xCharsForTx, &cChar,
                                &xHigherPriorityTaskWoken) == pdTRUE)
        {
            /* A character was retrieved from the queue so can be sent to the
             THR now. */
            LL_USART_TransmitData8(USART1, cChar);
        }
        else
        {
            LL_USART_DisableIT_TXE(USART1);
        }
    }

    if(LL_USART_IsActiveFlag_RXNE(USART1) && LL_USART_IsEnabledIT_RXNE(USART1))
    {
        cChar = LL_USART_ReceiveData8(USART1);
        xQueueSendFromISR(xRxedChars, &cChar, &xHigherPriorityTaskWoken);
    }
    portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}
